## [ethanhassett](https://hassettio.app.spacelift.io/stack/ethanhassett/run/01J9HMYZZWTNXFZJEFHHHDK698) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J9DSFRY26PD9TJ60F92J40S3] Planning changes with 0 custom hooks...
data.hcp_vault_secrets_secret.cloudflare_api_token: Reading...
data.hcp_vault_secrets_secret.google_credentials: Reading...
data.hcp_vault_secrets_secret.google_credentials: Read complete after 0s [id=spacelift]
data.hcp_vault_secrets_secret.cloudflare_api_token: Read complete after 0s [id=spacelift]
data.cloudflare_zone.this: Reading...
data.cloudflare_zone.this: Read complete after 1s [id=f96446d78e054da3fe5c6ace7557f782]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_cloud_run_domain_mapping.this will be created
  + resource "google_cloud_run_domain_mapping" "this" {
      + id       = (known after apply)
      + location = "us-east1"
      + name     = "ethanhassett.com"
      + project  = "ethanhassett"
      + status   = (known after apply)

      + metadata {
          + effective_annotations = (known after apply)
          + effective_labels      = {
              + "goog-terraform-provisioned" = "true"
              + "repo"                       = "ethanhassett"
            }
          + generation            = 0
          + namespace             = "ethanhassett"
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = {
              + "goog-terraform-provisioned" = "true"
              + "repo"                       = "ethanhassett"
            }
          + uid                   = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "ethanhassett"
        }
    }

  # google_cloud_run_service_iam_binding.this will be created
  + resource "google_cloud_run_service_iam_binding" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-east1"
      + members  = [
          + "allUsers",
        ]
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "ethanhassett"
    }

  # google_cloud_run_v2_service.this will be created
  + resource "google_cloud_run_v2_service" "this" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + description             = "Cloud Run service for ethanhassett.com"
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
          + "repo"                       = "ethanhassett"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-east1"
      + name                    = "ethanhassett"
      + observed_generation     = (known after apply)
      + project                 = "ethanhassett"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
          + "repo"                       = "ethanhassett"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN1"
          + max_instance_request_concurrency = 1000
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "docker.io/hassett/ethanhassett:0.0.2"

              + ports {
                  + container_port = 4321
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle = true
                  + limits   = {
                      + "cpu"    = "2"
                      + "memory" = "1024Mi"
                    }
                }
            }
        }
    }

  # google_project_iam_binding.cloud_run_admin will be created
  + resource "google_project_iam_binding" "cloud_run_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "ethanhassett"
      + role    = "roles/run.admin"
    }

  # google_project_iam_binding.service_account_user will be created
  + resource "google_project_iam_binding" "service_account_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "ethanhassett"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_service_account.cloud_run will be created
  + resource "google_service_account" "cloud_run" {
      + account_id   = "cloudrun"
      + description  = "Service account for Cloud Run"
      + disabled     = false
      + display_name = "cloudrun"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "ethanhassett"
      + unique_id    = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

[01J9DSFRY26PD9TJ60F92J40S3] Changes are GO
[01J9DSFRY26PD9TJ60F92J40S3] Uploading the list of managed resources...
[01J9DSFRY26PD9TJ60F92J40S3] Please be aware that the run changes calculation includes output changes.
[01J9DSFRY26PD9TJ60F92J40S3] Resource list upload is GO
[01J9DSFRY26PD9TJ60F92J40S3] Generating JSON representation of the plan...
[01J9DSFRY26PD9TJ60F92J40S3] JSON representation is GO
[01J9DSFRY26PD9TJ60F92J40S3] Loading custom plan policy inputs...
[01J9DSFRY26PD9TJ60F92J40S3] 0 custom plan policy inputs found
[01J9DSFRY26PD9TJ60F92J40S3] No plan policies to evaluate
```

</details>